chefboard/app/controllers/recipes_controller.rb

  def index
    user = User.find(params[:user_id])
    @recipes = Recipe.where(user_id: user.id)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "recipes".* FROM "recipes"  WHERE "recipes"."user_id" = 1

  def show
    recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = ? LIMIT 1  [["id", "id"]]

  def create
    Recipe.create(recipe_params)
---
INSERT INTO "recipes" ("category_id", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 1], ["created_at", "2014-11-29 01:15:27.805149"], ["title", "The new"], ["updated_at", "2014-11-29 01:15:27.805149"]]

  def destroy
    recipe = Recipe.find_by(id: params[:id])
    recipe.destroy
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 1 LIMIT 1
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]