app/controllers/recipes_controller.rb

  def index
    fb_id = params[:user_id]


    if User.find_by_facebook_id(fb_id) == nil
      # p "*" * 50
      # p "in create user section"
      @oauth = Koala::Facebook::OAuth.new(ENV['APP_ID'], ENV['APP_SECRET'], ENV['CALLBACK_URI'])
      @facebook_cookies = @oauth.get_user_info_from_cookies(cookies)
      @fb_user_id = @facebook_cookies["user_id"]
      @access_token = @facebook_cookies["access_token"]
      @graph = Koala::Facebook::API.new(@access_token)
      graph = @graph.get_object("#{@fb_user_id}")
      # p "*" * 50
      user = User.new(facebook_id: @fb_user_id,
                      first_name: graph["first_name"],
                      last_name: graph["last_name"],
                      email: graph["email"])
      if user.save
        p "saved!"
      else
        p "didn't save"
      end

    else
      # p "!" * 50
      user = User.find_by_facebook_id(fb_id)
      @recipes = user.recipes.order('created_at desc')
---
SELECT "recipes".* FROM "recipes"   ORDER BY created_at desc

  def create

    user = User.find_by_facebook_id(fb_id)

    @recipe = Recipe.new(recipe_params)
    category = params[:category] || "Appetizers"
    @recipe.category_id = Category.get_category_id(category)

    recipe_tags = params[:tags]
    tags_array = recipe_tags.split(',')
    tags_array.map! {|tag| tag.strip}

    tags_array = Tag.process_tags(params[:tags])

    tags_array.each do |tag|
      if Tag.find_by_name(tag) == nil
        @recipe.tags << Tag.create(name: tag)
      else
        @recipe.tags << Tag.find_by_name(tag)
      end
    end

    if @recipe.save
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."name" = 'pasta' LIMIT 1
INSERT INTO "recipes" ("category_id", "created_at", "img_url", "source_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 0], ["created_at", "2014-11-29 20:42:35.374002"], ["img_url", "test"], ["source_url", "test"], ["title", "test"], ["updated_at", "2014-11-29 20:42:35.374002"]]
INSERT INTO "tags" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-11-30 01:09:23.527197"], ["name", "pasta"], ["updated_at", "2014-11-30 01:09:23.527197"]]
SELECT  "categories".* FROM "categories"  WHERE "categories"."name" = 'Desserts' LIMIT 1
UPDATE "recipes" SET "updated_at" = ?, "user_id" = ? WHERE "recipes"."id" = 12  [["updated_at", "2014-12-01 00:03:45.253788"], ["user_id", 1]]